## Import Heroku PostgreSQL database into Pandas.
### proj2-team02: TeamMovies
### Project #2
### September 2020

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

plt.rcParams['figure.figsize'] = (14.0, 8.0)

# Reflect Tables into SQLAlchemy ORM

In [2]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func, inspect, MetaData, Table, select

# Initialize the Base object using the automap_base in order to refelect the database.
from sqlalchemy.ext.automap import automap_base
Base = automap_base()
metadata = MetaData()

### Testing the Heroku Postgres

In [3]:
# Create an engine that can talk to the database
DATABASE_URL = 'postgres://zttrfwwdkbvjri:993e860c0b322e56c742c10a0edd25113b9ed456845f9c82571ae166641b32f3@ec2-100-25-100-81.compute-1.amazonaws.com:5432/d90qpidcl4m7ls'
engine = sqlalchemy.create_engine(DATABASE_URL)

## Explore Database

In [4]:
# Use the Inspector to explore the Herohu database and print the table names
inspector = inspect(engine)
inspector.get_table_names()

['country_origin',
 'movie_country_junction',
 'production_company',
 'movie',
 'genre',
 'movie_genre_junction',
 'language',
 'movie_language_junction',
 'job_title',
 'movie_person_title_junction',
 'person']

In [5]:
# Print the names of tables in the Heroku PostgreSQL database:
print(engine.table_names())

['country_origin', 'movie_country_junction', 'production_company', 'movie', 'genre', 'movie_genre_junction', 'language', 'movie_language_junction', 'job_title', 'movie_person_title_junction', 'person']

In [6]:
# Use Inspector to print the column names and types for the movie table.
columns = inspector.get_columns('movie')
for col in columns:
    print(col['name'], col["type"])

movie_id VARCHAR(100)
movie_title TEXT
year_published INTEGER
movie_duration INTEGER
description TEXT
votes_avg DOUBLE PRECISION
votes_count INTEGER
budget VARCHAR(50)
usa_gross_income VARCHAR(50)
worlwide_gross_income VARCHAR(50)
company_id VARCHAR(100)

In [8]:
# Use Inspector to print the column names and types for the movie_genre_junction table.
columns = inspector.get_columns('movie_genre_junction')
for col in columns:
    print(col['name'], col["type"])

movie_id VARCHAR(100)
genre_id VARCHAR(100)

In [9]:
# Use Inspector to print the column names and types for the genre table.
columns = inspector.get_columns('genre')
for col in columns:
    print(col['name'], col["type"])

genre_id VARCHAR(100)
genre_name VARCHAR(255)

## Refection of Heroku database

In [10]:
# Use the prepare method on the Base object create a refection of the entire database.
Base.prepare(engine, reflect=True)

In [11]:
#The relection created ORM objects of tables in the database, and accessible under the class property of the automap Base.
Base.classes.keys()

['country_origin',
 'movie_country_junction',
 'production_company',
 'movie',
 'genre',
 'language',
 'job_title',
 'movie_person_title_junction',
 'person']

In [12]:
# Let's create reference to the ORM objects.
Country_origin = Base.classes.country_origin
Movie_country_junction = Base.classes.movie_country_junction
Production_company = Base.classes.production_company
Movie = Base.classes.movie
Genre = Base.classes.genre
Language = Base.classes.language
Job_title = Base.classes.job_title
movie_person_title_junction = Base.classes.movie_person_title_junction
Person = Base.classes.person

In [13]:
# Create our session link for Python to interact with the database.
session = Session(engine)

In [14]:
# Let's create a function that will take a ORM query statement and create a Pandas DataFrame!
def query_to_dataframe(query_stmt, my_database = engine):
    query_df = pd.read_sql_query(query_stmt, my_database)
    return query_df

### Let's reflect the movie_genre_junction table separately

In [15]:
metadata.reflect(bind=engine)

In [16]:
metadata.tables.keys()

dict_keys(['country_origin', 'movie_country_junction', 'production_company', 'movie', 'genre', 'movie_genre_junction', 'language', 'movie_language_junction', 'job_title', 'movie_person_title_junction', 'person'])

In [17]:
# Let's reflect the movie_genre_junction table separately, since it didn't get refected in during the automap Base
Movie_genre_junction = Table("movie_genre_junction", metadata, autoload=True, autoload_with=engine)

In [18]:
# Using the movie_genre_junction reflected table
Movie_genre_junction.columns.keys()

['movie_id', 'genre_id']

In [19]:
# The query statement
query_stmt = session.query(Movie_genre_junction).statement
query_df = pd.read_sql_query(query_stmt, session.bind)
query_df.head()

    movie_id genre_id
0  tt0000574        0
1  tt0000574        1
2  tt0000574        2
3  tt0001892        2
4  tt0002101        2

In [20]:
# Use a PostgreSQL query to get content of the movie table
movie_genre_junction_query = '''
SELECT * FROM public.movie_genre_junction
'''
# Create DataFrame from PostgreSQL query result.
movie_genre_junction_df = query_to_dataframe(movie_genre_junction_query)
# Display the DataFrame of the query results.
movie_genre_junction_df.head()

    movie_id genre_id
0  tt0000574        0
1  tt0000574        1
2  tt0000574        2
3  tt0001892        2
4  tt0002101        2

In [ ]:
connection.close()